In [1]:
import pandas as pd
import numpy as np
import seaborn as sns

In [2]:
data_wide = {
    'Salesperson': ['Alice', 'Bob', 'Charlie'],
    'Apples': [330, 0, 0],
    'Bananas': [0, 370, 0],
    'Oranges': [0, 0, 175]
}

In [3]:
df = pd.DataFrame(data_wide)

In [4]:
df

  Salesperson  Apples  Bananas  Oranges
0       Alice     330        0        0
1         Bob       0      370        0
2     Charlie       0        0      175

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Salesperson  3 non-null      object
 1   Apples       3 non-null      int64
 2   Bananas      3 non-null      int64
 3   Oranges      3 non-null      int64
dtypes: int64(3), object(1)
memory usage: 228.0+ bytes

In [6]:
melted_df = pd.melt(df,id_vars="Salesperson",value_vars=["Apples","Bananas","Oranges"],var_name="Product",value_name="Sales")

In [7]:
melted_df

  Salesperson  Product  Sales
0       Alice   Apples    330
1         Bob   Apples      0
2     Charlie   Apples      0
3       Alice  Bananas      0
4         Bob  Bananas    370
5     Charlie  Bananas      0
6       Alice  Oranges      0
7         Bob  Oranges      0
8     Charlie  Oranges    175

## melt() turns columns into rows
## When to use melt():
#### 1. When preparing data for visualization (most plotting libraries prefer long format)
#### 2. Before using groupby operations on what were previously column names